#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.web must be replaced
-/+ resource "aws_instance" "web" {
        ami                          = "ami-0dc45e3d9be6ab7b5"
      ~ arn                          = "arn:aws:ec2:us-east-1:885850720618:instance/i-0e858d990452bcd08" -> (known after apply)
        associate_public_ip_address  = true
      ~ availability_zone            = "us-east-1b" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 1 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
        get_password_data            = false
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0e858d990452bcd08" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
        instance_type                = "t2.micro"
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
        key_name                     = "ec2-key-tf"
      - monitoring                   = false -> null
      + network_interface_id         = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0a0c735090e8fe3aa" -> (known after apply)
      ~ private_dns                  = "ip-10-0-2-34.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.0.2.34" -> (known after apply)
      + public_dns                   = (known after apply)
      ~ public_ip                    = "3.235.199.137" -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
        source_dest_check            = true
      ~ subnet_id                    = "subnet-06adf59dcec57b83c" -> (known after apply) # forces replacement
        tags                         = {
            "Name" = "HelloWorld"
        }
      ~ tenancy                      = "default" -> (known after apply)
        user_data                    = "e6558b02347cc14a2f8e639c2c025389695966ef"
      ~ volume_tags                  = {} -> (known after apply)
        vpc_security_group_ids       = [
            "sg-00b62e260feb71657",
        ]

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ volume_id             = "vol-0c17fc4661af890dc" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_route_table_association.a must be replaced
-/+ resource "aws_route_table_association" "a" {
      ~ id             = "rtbassoc-0d68713626470bb8f" -> (known after apply)
        route_table_id = "rtb-03562ceff2a162970"
      ~ subnet_id      = "subnet-0e7c3760ce893948f" -> (known after apply) # forces replacement
    }

  # aws_route_table_association.b must be replaced
-/+ resource "aws_route_table_association" "b" {
      ~ id             = "rtbassoc-0bddc7568f3f0b3ad" -> (known after apply)
        route_table_id = "rtb-03562ceff2a162970"
      ~ subnet_id      = "subnet-06adf59dcec57b83c" -> (known after apply) # forces replacement
    }

  # aws_subnet.example["10.0.1.0/24"] will be created
  + resource "aws_subnet" "example" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + vpc_id                          = "vpc-0ac9c3b1634ea77e9"
    }

  # aws_subnet.example["10.0.2.0/24"] will be created
  + resource "aws_subnet" "example" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + vpc_id                          = "vpc-0ac9c3b1634ea77e9"
    }

  # aws_subnet.private-a will be destroyed
  - resource "aws_subnet" "private-a" {
      - arn                             = "arn:aws:ec2:us-east-1:885850720618:subnet/subnet-0270c62da63b47e86" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "us-east-1d" -> null
      - availability_zone_id            = "use1-az4" -> null
      - cidr_block                      = "10.0.3.0/24" -> null
      - id                              = "subnet-0270c62da63b47e86" -> null
      - map_public_ip_on_launch         = false -> null
      - owner_id                        = "885850720618" -> null
      - tags                            = {
          - "Name" = "private-a-tf"
        } -> null
      - vpc_id                          = "vpc-0ac9c3b1634ea77e9" -> null
    }

  # aws_subnet.private-b will be destroyed
  - resource "aws_subnet" "private-b" {
      - arn                             = "arn:aws:ec2:us-east-1:885850720618:subnet/subnet-03ebf3b4255914dd6" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "us-east-1f" -> null
      - availability_zone_id            = "use1-az5" -> null
      - cidr_block                      = "10.0.4.0/24" -> null
      - id                              = "subnet-03ebf3b4255914dd6" -> null
      - map_public_ip_on_launch         = false -> null
      - owner_id                        = "885850720618" -> null
      - tags                            = {
          - "Name" = "private-b-tf"
        } -> null
      - vpc_id                          = "vpc-0ac9c3b1634ea77e9" -> null
    }

  # aws_subnet.public-a will be destroyed
  - resource "aws_subnet" "public-a" {
      - arn                             = "arn:aws:ec2:us-east-1:885850720618:subnet/subnet-0e7c3760ce893948f" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "us-east-1c" -> null
      - availability_zone_id            = "use1-az2" -> null
      - cidr_block                      = "10.0.1.0/24" -> null
      - id                              = "subnet-0e7c3760ce893948f" -> null
      - map_public_ip_on_launch         = false -> null
      - owner_id                        = "885850720618" -> null
      - tags                            = {
          - "Name" = "public-a-tf"
        } -> null
      - vpc_id                          = "vpc-0ac9c3b1634ea77e9" -> null
    }

  # aws_subnet.public-b will be destroyed
  - resource "aws_subnet" "public-b" {
      - arn                             = "arn:aws:ec2:us-east-1:885850720618:subnet/subnet-06adf59dcec57b83c" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "us-east-1b" -> null
      - availability_zone_id            = "use1-az1" -> null
      - cidr_block                      = "10.0.2.0/24" -> null
      - id                              = "subnet-06adf59dcec57b83c" -> null
      - map_public_ip_on_launch         = false -> null
      - owner_id                        = "885850720618" -> null
      - tags                            = {
          - "Name" = "public-b-tf"
        } -> null
      - vpc_id                          = "vpc-0ac9c3b1634ea77e9" -> null
    }

  # aws_subnet.public-c will be destroyed
  - resource "aws_subnet" "public-c" {
      - arn                             = "arn:aws:ec2:us-east-1:885850720618:subnet/subnet-032461fefed970df6" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "us-east-1f" -> null
      - availability_zone_id            = "use1-az5" -> null
      - cidr_block                      = "10.0.5.0/24" -> null
      - id                              = "subnet-032461fefed970df6" -> null
      - map_public_ip_on_launch         = false -> null
      - owner_id                        = "885850720618" -> null
      - tags                            = {
          - "Name" = "public-c-tf"
        } -> null
      - vpc_id                          = "vpc-0ac9c3b1634ea77e9" -> null
    }

Plan: 5 to add, 0 to change, 8 to destroy.

Warning: Interpolation-only expressions are deprecated

  on main.tf line 96, in resource "aws_security_group" "allow_http":
  96:   vpc_id      = "${aws_vpc.default.id}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions3`, Working Directory: `.`*
